---
kind: other
id: Properties.T:Autodesk.Revit.DB.CylindricalSurface
source: html/ec303cd4-1d0f-29db-47d2-6253db46e096.htm
---
# CylindricalSurface Properties

Axis of the cylinder. This is the Z axis of the local coordinate system associated with this cylinder.